codeigniter4-framework-d021b04/app/Controllers/Buku.php

    public function index()
    {
        $data['buku'] = $this->bukuModel->findAll();
---
SELECT *
FROM `buku`

    public function store()
    {
        $rules = [
            'judul' => 'required',
            'penulis' => 'required',
            'penerbit' => 'required',
            'tahun_terbit' => 'required|integer|greater_than[1800]|less_than[2024]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->bukuModel->save($this->request->getPost());
---
INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `tahun_terbit`) VALUES ('zajhai', 'jaksjla', 'aksja', '1998')

    public function delete($id)
    {
        $this->bukuModel->delete($id);
---
DELETE FROM `buku`
WHERE `id` IN ('2')